#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/shir-dev-uai001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001][0m
[0m[1mazapi_resource.subnet_container: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ContainerSubnet][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_administrator: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/2c8b4528-2050-a981-d047-5bc1b7ee0857][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/8f07e442-d1db-2c47-43b7-40bc5f18f137][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001|logAnalytics][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Reading...[0m[0m
[0m[1mazurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001|logAnalytics][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_shir_key: Refreshing state... [id=https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/bfd49c6fa569414686810ca0d721fd0b][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mazurerm_windows_web_app.windows_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-kv001-pe][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-adf001-pe][0m
[0m[1mazurerm_private_endpoint.windows_web_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-asp001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001|logAnalytics][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_windows_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_windows_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001"
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_windows_web_app" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_windows_web_app.windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_windows_web_app" "windows_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [33m~[0m[0m "AUTH_KEY"                            = "@Microsoft.KeyVault(SecretUri=https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/bfd49c6fa569414686810ca0d721fd0b)" [33m->[0m[0m "@Microsoft.KeyVault(SecretUri=https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key)"
            [90m# (7 unchanged elements hidden)[0m[0m
        }
        id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001"
        name                                           = "shir-dev-asp001"
        tags                                           = {
            "workload" = "shir-runners"
        }
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>